{
    "1": {
        "id": "1",
        "name": "Chocolate brownies",
        "description": "Do you like chocolate? Then you are going to love today's recipe. It's very easy to make fantastic chocolate brownies. Follow my recipe and I'm sure you will not be disappointed. Their name comes from their brown colour. Nobody is sure who invented this famous American dessert and there are lots of different stories about who wrote the first brownie recipe and where. One thing isn't a mystery: they are really delicious; crispy on top and fudgy in the middle. Give them a go and let me know!",
        "preptime": 20,
        "difficulty": "Easy",
        "cooktime": 35,
        "servings": 9,

        "calories": 2565,
        "fat": 159,
        "satfat": 67,
        "carbs": 76,
        "fiber": 4,
        "sugar": 6,
        "protein": 200,

        "ingredients": [
            { "name": "dark chocolate", "amount": 220, "unit": "g" },
            { "name": "butter", "amount": 150, "unit": "g" },
            { "name": "all-purpose flour", "amount": 120, "unit": "g" },
            { "name": "cocoa powder", "amount": 15, "unit": "g" },
            { "name": "salt", "amount": 1, "unit": "pinch" },
            { "name": "eggs", "amount": 4, "unit": "" },
            { "name": "caster sugar", "amount": 200, "unit": "g" },
            { "name": "vanilla extract", "amount": 0.5, "unit": "coffe spoon" }
        ],

        "instructions": [
            { "stepNumber": "First preheat the oven to 180° degrees. Cut the butter into small cubes. Break the dark chocolate into small pieces." },
            { "stepNumber": "Put the butter and the chocolate in a heatproof bowl and place it on top of a casserole pan of barely simmering water. Melt them stirring occasionally until smooth, shiny and glossy. Then let the melted mixture cool at room temperature." },
            { "stepNumber": "When the mixture is almost cool, add the eggs (two at a time) and mix until well combined. Then add the sugar and the vanilla and mix again." },
            { "stepNumber": "Weigh the flour, the cocoa powder and the salt and mix them. Then sift the mixture and beat until combined." },
            { "stepNumber": "Line a 20 (or 22) cm square tin with non-stick baking paper. Pour the batter into the prepared tin and level it using a spatula. Spread it to all four sides of the tin." },
            { "stepNumber": "Bake the apple cake in the oven for approx 25/30 minutes. The cake is done when you insert a cake tester (or even a simple toothpick) into the centre of the cake and it comes out lightly humid. " },
            { "stepNumber": "Finally, remove from the oven and leave it in the tin until completely cold. Then lift out the cake using the baking paper and cut into 9 quarters. If you prefer smaller chocolate brownies, you can cut each quarter into 4 squares." },
            { "stepNumber": "You can keep them in a sealed container at room temperaturefor up to 3 days.You can also freeze themfor up to a month.Enjoy!" }
        ],
        "images": [
            { "path": "https://i.pinimg.com/564x/00/c4/b3/00c4b355d2496be3c6d7ce3034418b4d.jpg" },
            { "path": "https://i.pinimg.com/564x/de/ba/69/deba69aa6fb7e4441770a2ac99b9e5f5.jpg" }
        ]
    },

    "2": {
        "id": "2",
        "name": "Chocolate nut biscuits",
        "description": " I just say one thing: try these chocolate nut biscuits because they are really delicious. They are made with simple ingredients and they are perfect for breakfast and as snacks too. A very simple and easy to make recipe.",
        "preptime": 10,
        "difficulty": "Easy",
        "cooktime": 10,
        "servings": 16,

        "calories": 2565,
        "fat": 159,
        "satfat": 67,
        "carbs": 76,
        "fiber": 4,
        "sugar": 6,
        "protein": 200,

        "ingredients": [
            { "name": "white flour", "amount": 175, "unit": "g" },
            { "name": "softened butter", "amount": 100, "unit": "g" },
            { "name": "sugar", "amount": 150, "unit": "g" },
            { "name": "egg", "amount": 1, "unit": "" },
            { "name": "baking soda", "amount": 0.5, "unit": "coffe spoon " },
            { "name": "chocolate chips", "amount": 60, "unit": "g" },
            { "name": "kernels nut", "amount": 30, "unit": "g" },
            { "name": "salt", "amount": 1, "unit": "pinch" },
            { "name": "powdered sugar", "amount": 0, "unit": "" }
        ],

        "instructions": [
            { "stepNumber": "Preheat oven to 190°. In a bowl, beat the softened butter with the sugar until creamy." },
            { "stepNumber": " Then add the egg." },
            { "stepNumber": "Mix and add the white flour sifted with the baking soda and the salt." },
            { "stepNumber": "Add the chopped nuts and the chocolate chips." },
            { "stepNumber": "Mix to combine all the ingredients." },
            { "stepNumber": "Drop by spoonfuls onto a baking sheet." },
            { "stepNumber": "Bake for 10 minutes in the preheated oven." }
        ],
        "images": [
            { "path": "https://i.pinimg.com/564x/4d/50/49/4d5049e7ae77b58bee99ccd7678a9772.jpg" },
            { "path": "https://i.pinimg.com/564x/1a/27/82/1a2782f6c5d27cbd81eff4e97ac909ba.jpg" }
        ]

    },
    "3": {
        "id": "3",
        "name": "Ricotta cheese and chocolate cups",
        "description": "Nothing could be easier than making these ricotta cheese and chocolate cups. A delicious, creamy dessert that I want to share with you. Everybody will love it!",
        "preptime": 10,
        "difficulty": "Medium",
        "cooktime": 10,
        "servings": 16,

        "calories": 2565,
        "fat": 159,
        "satfat": 67,
        "carbs": 76,
        "fiber": 4,
        "sugar": 6,
        "protein": 200,

        "ingredients": [
            { "name": "ricotta cheese", "amount": 250, "unit": "g" },
            { "name": "powdered sugar", "amount": 20, "unit": "g" },
            { "name": "organic orange", "amount": 1, "unit": "zest" },
            { "name": "dark chocolate", "amount": 40, "unit": "g" },
            { "name": "biscuits", "amount": 50, "unit": "g" },
            { "name": "brandy or rum", "amount": 1, "unit": "dl" }
        ],

        "instructions": [
            { "stepNumber": "Chop chocolate with a knife. Set aside." },
            { "stepNumber": " Wash the orange thoroughly and zest it. Remove just the very outer layer of skin (you can use a zester or a grater). Set aside." },
            { "stepNumber": "Slice the orange in half and squeeze it (you can use a plain or an electric juicer)." },
            { "stepNumber": "Filter the orange juice with a fine mesh stainer." },
            { "stepNumber": "Add a tablespoon of rum or brandy to the filtered orange juice (optional). Break the biscuits into small pieces, but do not powder them (you can use a rolling pin, the back of a spoon or a meat tenderizer). Put them in a bowl." },
            { "stepNumber": "Pour the orange juice over the biscuits and gently mix with a spoon. Set aside." },
            { "stepNumber": " Put the ricotta cheese and the sugar in a bowl. Beat them with an electric whisk for a couple of minutes, then add the orange zest (set aside a little bit of it for the final decoration).  " },
            { "stepNumber": "Mix with a spoon to combine all the ingredients.            " },
            { "stepNumber": "Put two teaspoons of biscuits in the base of each serving cup. Cover them with a layer of ricotta cream, then sprinkle some chopped chocolate over the cream." },
            { "stepNumber": "Add a second layer of bisuits;cover with ricotta cream and sprinkle other chopped chocolate.To finish, decorate each cup with the zest previouslyset aside.Store the chocolate cups in the fridge until ready to serve." }
        ],
        "images": [
            { "path": "https://blog.giallozafferano.it/paola67/wp-content/uploads/2016/01/ricotta-cheese-and-chocolate-cup.jpg" },
            { "path": "https://blog.giallozafferano.it/paola67/wp-content/uploads/2016/01/ricotta-cheese-and-chocolate-cup-.jpg" }
        ]

    },
    "4": {
        "id": "4",
        "name": "Tiramisù",
        "description": "Back in the day, grandmothers used to prepare a breakfast that we might call humble today, but was considered very rich at the time! Today the recipe is still unchanged, just break a very fresh egg into a glass, beat it with sugar, and add coffee or hot milk, for children, or Marsala wine or aniseed for adults. This marvelous cream gave rise to mascarpone cream used to make Tiramisù (mascarpone cheese and ladyfingers dessert). This is the best Italian dessert, the most popular and beloved of them all, and it has also birthed many other versions, even an egg-free Tiramisù! There is also a strawberry and Nutella tiramisù! Although the origins of this famous dessert are unclear, because it is disputed between the regions of Veneto, Friuli-Venezia Giulia, Piedmont, and Tuscany, it remains a cornerstone of Italian cuisine and it's widely prepared from North to South. Unfortunately, we weren't able to find out who invented it, but we can certainly teach you how to prepare your best tiramisù ever. So here's the recipe: try it and let us know what you think!",
        "preptime": 40,
        "difficulty": "Easy",
        "cooktime": 2,
        "servings": 8,

        "calories": 2565,
        "fat": 159,
        "satfat": 67,
        "carbs": 76,
        "fiber": 4,
        "sugar": 6,
        "protein": 200,

        "ingredients": [
            { "name": "ladyfingers", "amount": 300, "unit": "g" },
            { "name": "eggs", "amount": 4, "unit": "" },
            { "name": "mascarpone cheese", "amount": 500, "unit": "g" },
            { "name": "sugar", "amount": 100, "unit": "g" },
            { "name": "coffee", "amount": 300, "unit": "g" },
            { "name": "cocoa powder", "amount": 0, "unit": "little bit" }
        ],

        "instructions": [
            { "stepNumber": "To prepare tiramisù, start with very fresh eggs: carefully separate the egg whites from the yolks 1, remembering that to whip the egg whites well they must not contain any trace of yolk." },
            { "stepNumber": "Then whip the egg yolks with a hand mixer, pouring in only half of the sugar 2. " },
            { "stepNumber": "As soon as the mixture has become clear and frothy 3,and with the mixer still running, you can add mascarpone cheese, little by little 4.            " },
            { "stepNumber": "When all the cheese is incorporated, you will have obtained a thick and compact cream; set it aside 5." },
            { "stepNumber": " Clean the mixer attachments very well and beat the egg whites, pouring in the remaining sugar a little at a time 6." },
            { "stepNumber": "Whisk them into stiff peaks 7; you will know they're ready if the mixture does not move when you overturn the bowl. " },
            { "stepNumber": " Take a spoonful of egg whites and pour it into the bowl with egg yolks and sugar and stir vigorously with a spatula, to thin the mixture 8." },
            { "stepNumber": "Then proceed to add the remaining egg whites, little by little, stirring very gently from bottom to top 9.            " },
            { "stepNumber": "Once ready, place a generous spoonful of cream on the bottom of a 12x8in baking pan and spread it evenly 11. " },
            { "stepNumber": "Then soak the ladyfingers for a few moments in the cooled coffee, which you will have sweetened to your liking (we added only 1 teaspoon of sugar) 12,first on one side and then the other." },
            { "stepNumber": " Arrange the soaked ladyfingers on top of the cream 14, side by side, to create the first layer, over which you will spread part of the mascarpone cheese cream 15." },
            { "stepNumber": "Make sure to level it carefully so that you have a smooth surface 16." },
            { "stepNumber": " Continue to arrange the coffee-soaked ladyfingers 17, then add another layer of cream 18." },
            { "stepNumber": "Level the surface 19, sprinkle it with unsweetened cocoa powder, and allow it to set in the fridge for a couple of hours 20. " },
            { "stepNumber": "Your Tiramisù is ready to be enjoyed 21!" }
        ],

        "images": [
            { "path": "https://i.pinimg.com/564x/16/60/85/166085a34e9f72bb7424399e7235e0c3.jpg" },
            { "path": "https://i.pinimg.com/564x/9d/b7/69/9db76980fcdc4a27266a23b03b9fad3c.jpg" }
        ]

    },

    "5": {
        "id": "5",
        "name": "Fig cake",
        "description": "Sugary, luscious figs are a delightful accompaniment to summer days. Fresh from our triumph with delicious, melt-in-the-mouth shortbread cookies, today we invite you to try your hand at making a beautiful cake that is as bronzed as your suntan at the end of the summer holidays: This fig cake is the best way to bid the summer adieu. This dessert is super-easy to prepare and, above all, delicious to eat. Let yourself be seduced by the soft, fragrant texture of this cake, which forms a perfect bed for firm-fleshed figs. Don't neglect to embellish them with sliced almonds and brown sugar, which will give these fruits a gorgeous golden color. This fig cake is a great snack or dessert and a perfect accompaniment as you browse pictures and postcards from summers past: Are you ready to enjoy it with your friends as you think back to your holidays and start to dream of your next trip?",
        "preptime": 20,
        "difficulty": "Easy",
        "cooktime": 45,
        "servings": 8,

        "calories": 2565,
        "fat": 159,
        "satfat": 67,
        "carbs": 76,
        "fiber": 4,
        "sugar": 6,
        "protein": 200,

        "ingredients": [
            { "name": "figs", "amount": 300, "unit": "g" },
            { "name": "almond flour", "amount": 50, "unit": "g" },
            { "name": "milk", "amount": 45, "unit": "g" },
            { "name": "lemon peel", "amount": 1, "unit": "" },
            { "name": "salt", "amount": 1, "unit": "pinch" },
            { "name": "flour", "amount": 150, "unit": "g" },
            { "name": "butter", "amount": 100, "unit": "g" },
            { "name": "eggs", "amount": 2, "unit": "" },
            { "name": "sugar", "amount": 100, "unit": "g" },
            { "name": "baking powder", "amount": 10, "unit": "g" }

        ],

        "instructions": [
            { "stepNumber": "To prepare the fig cake, start with the batter: Cut the butter (at room temperature) into chunks and place in the bowl of a stand mixer. Add the sugar 1 and run at medium-low speed until the mixture is light and fluffy. Beat the eggs with a fork in a bowl and then gradually add them to the mixture 2 until they are well blended. Then add a pinch of salt and, while the mixer is running, the grated lemon zest 3." },
            { "stepNumber": "With the mixer still running, sift the cake flour, almond flour 4, and baking powder 5 into a separate bowl and add this to the mixer bowl one spoonful at a time 6." },
            { "stepNumber": "When the powdered ingredients are well blended, add the milk at room temperature 7. Continue blending this batter until the milk is absorbed. Now pour the batter into a buttered and floured 9-inch (22-cm) springform cake pan 8. Using a spatula, spread and level the mixture evenly in the pan 9." },
            { "stepNumber": "Now move onto the figs: Peel them 10, then cut them into slices that are fairly thin 11. Go back to the cake pan and start arranging the fig slices in a circle." },
            { "stepNumber": "Start at one point 12 and keep adding the other figs until you've covered the entire surface, beginning at the outside and working your way in toward the center 13. Garnish the surface with the sliced almonds 14 and sprinkle with brown sugar 15." },
            { "stepNumber": "Once you've finished topping the cake 16, bake in a conventional oven preheated to 340°F (170°C) for 40-45 minutes. As the cake bakes, the raw sugar will add an amber sheen to the surface. If you find it too dark after the first half hour of baking, cover with foil for the rest of the baking time. Once baked, do the toothpick test: Pierce the cake with a toothpick, and if it comes out dry and clean, this means that the cake is ready 17." },
            { "stepNumber": " Once you've taken it out of the oven, leave it to cool and then remove it from the pan 18. Your cake is ready to be enjoyed!" }
        ],
        "images": [
            { "path": "https://www.pinterest.it/pin/431078995592315431/" },
            { "path": "https://i.pinimg.com/564x/50/b5/70/50b5705af89a0048750be8aa41582f4.jpg" }
        ]

    },

    "6": {
        "id": "6",
        "name": "Fish & chip traybake",
        "description": "Get that Friday feeling during the week with our healthier twist on takeaway favourite, fish and chips, made with sweet potatoes. Serve with mushy peas",
        "preptime": 20,
        "difficulty": "Easy",
        "cooktime": 35,
        "servings": 4,

        "calories": 396,
        "fat": 9,
        "satfat": 1,
        "carbs": 37,
        "fiber": 8,
        "sugar": 21,
        "protein": 37,

        "ingredients": [
            { "name": "sweet potatoes", "amount": 2, "unit": "pieces" },
            { "name": "rapeseed oil", "amount": 1, "unit": "tbsp" },
            { "name": "yogurt", "amount": 4, "unit": "tbsp" },
            { "name": "mayonnaise", "amount": 2, "unit": "tbsp" },
            { "name": "cornichons", "amount": 3, "unit": "pieces" },
            { "name": "shallot", "amount": 1, "unit": "piece" },
            { "name": "dill", "amount": 1, "unit": "tbsp" },
            { "name": "frozen peas", "amount": 300, "unit": "g" },
            { "name": "milk", "amount": 50, "unit": "ml" }


        ],

        "instructions": [
            { "stepNumber": "Heat the oven to 220C/200C fan/gas 8. Toss the sweet potatoes with the oil and some seasoning on a baking tray. Roast for 20 mins." },
            { "stepNumber": "Combine the yogurt, mayonnaise, cornichons and reserved brine, the shallot and dill with 1 tbsp cold water in a small bowl and set aside. " },
            { "stepNumber": "Meanwhile, put the peas in a pan with the milk, bring to a simmer and cook for 5 mins. Blitz the mixture using a hand blender until roughly puréed. Stir in the mint and season to taste. Set aside." },
            { "stepNumber": "Add the cod or pollock to the baking tray with the sweet potatoes, season and cook for 10-15 mins more, or until cooked through. Warm through the pea mixture. Scatter over some dill and serve the traybake with the yogurt tartare and the mushy peas." }
        ],
        "images": [
            { "path": "https://cdn.apartmenttherapy.info/image/upload/f_auto,q_auto:eco,c_fit,w_764,h_955/k%2FPhoto%2FRecipe%20Ramp%20Up%2F2021-10-Burrito-Casserole%2FIMG_8121_02" },
            { "path": "https://cdn.apartmenttherapy.info/image/upload/f_auto,q_auto:eco,c_fill,g_center,w_764,h_955/k%2FPhoto%2FRecipe%20Ramp%20Up%2F2021-10-Burrito-Casserole%2FIMG_095_01" }
        ]
    },
    "7": {
        "id": "7",
        "name": "Cheesy Beef Burrito Casserole",
        "description": "lip the script for taco night and make this cheesy burrito-inspired dinner! Ground beef, cheese, beans, and tortillas are layered to give you all the Tex-Mex vibes in one hearty, lasagna-like casserole. Bonus: It makes amazing leftovers.",
        "preptime": 15,
        "difficulty": "Easy",
        "cooktime": 42,
        "servings": 6,

        "calories": 396,
        "fat": 9,
        "satfat": 1,
        "carbs": 37,
        "fiber": 8,
        "sugar": 21,
        "protein": 37,

        "ingredients": [
            { "name": "red onion", "amount": 1, "unit": "piece" },
            { "name": "red bell pepper", "amount": 1, "unit": "piece" },
            { "name": "jalapeño", "amount": 1, "unit": "piece" },
            { "name": "garlic", "amount": 2, "unit": "gloves" },
            { "name": "tortillas", "amount": 8, "unit": "pieces" },
            { "name": "beef", "amount": 1, "unit": "kg" },
            { "name": "olive oil", "amount": 50, "unit": "ml" },
            { "name": "beans", "amount": 150, "unit": "g" },
            { "name": "oregano", "amount": 10, "unit": "g" },
            { "name": "salt", "amount": 10, "unit": "g" },
            { "name": "Mexican cheese blend", "amount": 3, "unit": "cups" }
        ],

        "instructions": [
            { "stepNumber": "Arrange a rack in the middle of the oven and heat the oven to 375℉." },
            { "stepNumber": "Dice 1 medium red onion. Core, seed, and dice 1 medium red bell pepper and 1 jalapeño if using. Mince 2 garlic cloves. Cut 8 (6-inch) tortillas in half." },
            { "stepNumber": "Heat a large skillet over medium-high heat until shimmering. Add 1 pound lean ground beef and cook, breaking up the meat with a wooden spoon, until browned and cooked through, 6 to 8 minutes. Using a slotted spoon, transfer the meat to a plate, then pour off any fat from the skillet." },
            { "stepNumber": "Add 2 tablespoons olive oil to the pan and heat over medium-high heat until shimmering. Add the onion, bell pepper, jalapeño or 4 ounces drained diced green chiles, and garlic. Cook, stirring occasionally, until softened, 5 to 7 minutes. Meanwhile, drain and rinse 1 can black or pinto beans." },
            { "stepNumber": "Return the beef and any accumulated juices to the skillet. Add 1 tablespoon taco seasoning, 1 teaspoon ground cumin, 1 teaspoon dried oregano, and 1/4 teaspoon black pepper. Cook, stirring often, until the spices are fragrant, about 2 minutes. Remove the pan from the heat.            " },
            { "stepNumber": "Spread 1 tablespoon tomato sauce from an 8-ounce can in the bottom of an 8x8-inch or other 2-quart baking dish. Pour the remaining sauce into the ground beef mixture and stir to combine. Taste and season with kosher salt and more cumin as needed.            " },
            { "stepNumber": "Arrange 5 tortilla halves in a single layer in the baking dish, overlapping them as needed. Spread half of the ground beef mixture over the tortillas, then top with half of the beans and sprinkle with 1 cup of the shredded Mexican cheese blend. Repeat layering 5 more tortilla halves, the remaining meat mixture, the remaining beans, and 1 cup of the shredded cheese. Top with the remaining tortilla halves and sprinkle with the remaining 1 cup cheese.            " },
            { "stepNumber": "Cover the baking dish loosely with aluminum foil. Bake for 15 minutes. Uncover and bake until the cheese is bubbly and beginning to brown, about 10 minutes. Let cool for at least 10 minutes before serving. Garnish with the desired toppings." }
        ],

        "images": [
            { "path": "https://cdn.apartmenttherapy.info/image/upload/f_auto,q_auto:eco,c_fill,g_center,w_764,h_955/k%2FPhoto%2FRecipe%20Ramp%20Up%2F2021-10-Burrito-Casserole%2FIM_8095_01" },
            { "path": "https://cdn.apartmenttherapy.info/image/upload/f_auto,q_auto:eco,c_fit,w_764,h_955/k%2FPhoto%2FRecipe%20Ramp%20Up%2F2021-10-Burrito-Casserole%2FIMG_8121_02" }
        ]

    },
    "8": {
        "id": "8",
        "name": "Salmon in the Oven",
        "description": "If you want an easy, fancy main dish, it doesn't get much better than roasted salmon fillets. It can be a midweek date night, an al fresco meal with friends, or dinner with the in-laws — salmon will rise to any occasion. I particularly like baking salmon in the oven, as it's more hands-off than cooking salmon on the stovetop.",
        "preptime": 6,
        "difficulty": "Easy",
        "cooktime": 6,
        "servings": 2,

        "calories": 396,
        "fat": 9,
        "satfat": 1,
        "carbs": 37,
        "fiber": 8,
        "sugar": 21,
        "protein": 37,

        "ingredients": [
            { "name": "salmon fillets", "amount": 8, "unit": "pieces" },
            { "name": "olive oil", "amount": 50, "unit": "ml" },
            { "name": "salt", "amount": 10, "unit": "g" },
            { "name": "pepper", "amount": 10, "unit": "g" },
            { "name": "Lemon wedges", "amount": 10, "unit": "pieces" }

        ],

        "instructions": [
            { "stepNumber": "Preheat the oven to 425°F: Heat the oven to 425°F with a rack placed in the middle. Line a roasting pan or baking sheet with foil.            " },
            { "stepNumber": "Pat the salmon dry: Pat the salmon dry with a paper towel.            " },
            { "stepNumber": "Rub the salmon with oil, salt, and pepper: Drizzle some oil over the top of each salmon — just enough to coat the salmon — and rub it over the salmon with your fingers or a pastry brush. Sprinkle the salmon generously with salt and pepper.            " },
            { "stepNumber": "Place the salmon in the roasting pan: Place the salmon in the roasting pan, skin-side down. Transfer to the oven.            " },
            { "stepNumber": " Roast for 4 to 6 minutes per half-inch thickness of salmon: Roasting time depends on the thickness of your salmon, as determined by the thickest part of the salmon fillet. For every half-inch of salmon, roast 4 to 6 minutes — 4 minutes will give you salmon that is still a touch rare, 6 minutes will thoroughly cook it.            " },
            { "stepNumber": "  Salmon is done when easily flaked: You can also check the doneness of your salmon with a fork. When the salmon flakes easily with a fork, it's ready. If you like, you can use an instant read thermometer to check the fish for doneness. The USDA recommends a minimum internal temperature of 145°F, which should be measured at the thickest part of the fillet." },
            { "stepNumber": "layering 5 more tortilla halves, the remaining meat mixture, the remaining beans, and 1 cup of the shredded cheese. Top with the remaining tortilla halves and sprinkle with the remaining 1 cup cheese.            " },
            { "stepNumber": "Serve immediately: Enjoy your salmon immediately. Leftovers will keep refrigerated for about 5 days, and can be gently reheated in the microwave or used cold.            " }
        ],
        "images": [
            { "path": "https://cdn.apartmenttherapy.info/image/upload/f_auto,q_auto:eco,c_fill,g_center,w_764,h_955/k%2Farchive%2Feaced28c7ac73b038c0d738bd40cc5624a35a39" },
            { "path": "https://cdn.apartmenttherapy.info/image/upload/f_auto,q_auto:eco,c_fit,w_764,h_591/k%2Farchive%2Fc1b4f1515bbe80db6539f6f857b2ec1e6bfafcbd" }
        ]

    },
    "9": {
        "id": "9",
        "name": "Southern grits",
        "description": "Southern grits are some of the creamiest, dreamiest grits on the planet. Made from stone-ground grits and slow cooked to perfection, they're finished with a generous heap of butter, cheese, and heavy cream. The result is slightly toothsome grits that rival the richest risotto — and are even easier to make.",
        "preptime": 15,
        "difficulty": "Easy",
        "cooktime": 35,
        "servings": 6,

        "calories": 396,
        "fat": 9,
        "satfat": 1,
        "carbs": 37,
        "fiber": 8,
        "sugar": 21,
        "protein": 37,

        "ingredients": [
            { "name": "water", "amount": 4, "unit": "cups" },
            { "name": "corn grits", "amount": 2.5, "unit": "cups" },
            { "name": "bay leaves", "amount": 2, "unit": "" },
            { "name": "kosher salt", "amount": 0.5, "unit": "teaspoon" },
            { "name": "butter", "amount": 60, "unit": "g" },
            { "name": "parmesan cheese", "amount": 2, "unit": "ounces" },
            { "name": "heavy cream", "amount": 120, "unit": "ml" }
        ],

        "instructions": [
            { "stepNumber": "Heat and soak the grits. Place 4 cups water, 1 1/2 cups grits, 2 dried bay leaves, and 1/2 teaspoon kosher salt in a large pot or Dutch oven and bring to a boil over high heat. Immediately remove from the heat, cover, and set aside for 15 minutes. Meanwhile, prepare the butter and cheese." },
            { "stepNumber": "Prepare the butter and cheese. Cut 8 tablespoons unsalted butter into 8 pieces and grate until you have 1/2 cup Parmesan cheese." },
            { "stepNumber": "Boil the grits. Uncover and return the grits to a boil over medium-high heat. Cook, stirring regularly with a whisk and scraping the bottom to prevent clumping or burning, for 20 to 25 minutes." },
            { "stepNumber": "Finish the grits. The grits are ready when most of the water is absorbed and the grits are al dente (tender with a toothsome bite). Remove from the heat. Remove and discard the bay leaves. Stir in the butter, cheese, and 1 cup heavy cream just before serving." }
        ],

        "images": [
            { "path": "https://cdn.apartmenttherapy.info/image/upload/f_auto,q_auto:eco,c_fill,g_center,w_764,h_955/k%2FPhoto%2FRecipes%2F2019-11-How-To-Make-Grits%2F2019-11-10_92150_How-to-Make-Grits-the-Souhern-Way" },
            { "path": "https://cdn.apartmenttherapy.info/image/upload/f_auto,q_auto:eco,c_fit,w_764,h_955/k%2FPhoto%2FRecipes%2F2019-11-How-To-Make-Grits%2F2019-11-10_92118_How-to-Make-Grits-the-Southern-Way" }
        ]

    },
    "10": {
        "id": "10",
        "name": "pepper and onion stew",
        "description": "pepper and onion stew is a very tasty summer side dish that is ideal to pair with delicate meats or fish. Perfect on hot bruschetta, peperonata is even good served as a sauce in pasta!",
        "preptime": 15,
        "difficulty": "Easy",
        "cooktime": 50,
        "servings": 4,

        "calories": 396,
        "fat": 9,
        "satfat": 1,
        "carbs": 37,
        "fiber": 8,
        "sugar": 21,
        "protein": 37,

        "ingredients": [
            { "name": "bell peppers", "amount": 1, "unit": "kg" },
            { "name": "onions", "amount": 400, "unit": "g" },
            { "name": "tomato puree", "amount": 400, "unit": "g" },
            { "name": "olive oil", "amount": 3, "unit": "tbsp" },
            { "name": "garlic", "amount": 2, "unit": "cloves" },
            { "name": "fine salt", "amount": 1, "unit": "pinch" }
        ],

        "instructions": [
            { "stepNumber": "To prepare peperonata,wash and dry the peppers.Then slice them lengthwise,all around the core 1,remove the white filaments and reduce them to thin layers 2. Peel and slice the onions 3." },
            { "stepNumber": "Pour a drizzle of oil and the whole garlic cloves into a large pan 4. Heat and add the onions 5. Stew the onions over medium-low heat for about 15 minutes, stirring occasionally. When they are softened and have released their water 6,pour in the peppers 7.   " },
            { "stepNumber": "Add salt 8 and pepper, then stir 9 and cover with a lid 10: cook the peppers for another 15 minutes over medium heat. " },
            { "stepNumber": "The peppers will be softened 11, remove the cloves of garlic, and pour in the tomato puree 12,stir 13 and cook for another 15 minutes with the lid on 14.             " },
            { "stepNumber": "Once cooked, your peperonata is ready to be enjoyed 15 hot, warm or even cold to accompany meat, fish or cheese dishes!" }
        ],
        "images": [
            { "path": "https://i.pinimg.com/564x/2d/5c/2c/2d5c2c3ba5d1175f52877e9c08ce276c.jpg" },
            { "path": "https://i.pinimg.com/564x/3b/3f/fe/3b3ffe5ef996971775b6b945d002a306.jpg" }
        ]
    },

    "11": {
        "id": "11",
        "name": "Slow Cooker Golden Chickpea Soup",
        "description": "As we move through the cold days of the new year, this is the soup you'll want to keep on repeat in your meal plan. It is wholesome comfort food at its finest, with a taste and texture that's equal parts hearty, bright, and completely nourishing. Slow cooking mellows the pungent, bitter bite of turmeric, and a dollop of yogurt partnered with a squeeze of fresh lemon juice lend a tangy twist to this vegetarian chickpea-based soup.",
        "preptime": 15,
        "difficulty": "Easy",
        "cooktime": 50,
        "servings": 8,

        "calories": 396,
        "fat": 9,
        "satfat": 1,
        "carbs": 37,
        "fiber": 8,
        "sugar": 21,
        "protein": 37,

        "ingredients": [
            { "name": "coconut oil", "amount": 15, "unit": "ml" },
            { "name": "onions", "amount": 200, "unit": "g" },
            { "name": "garlic", "amount": 2, "unit": "cloves" },
            { "name": "turmeric", "amount": 1, "unit": "tbsp" },
            { "name": "coriander", "amount": 1, "unit": "tbsp" },
            { "name": "salt", "amount": 1, "unit": "pinch" },
            { "name": "black pepper", "amount": 1, "unit": "pinch" },
            { "name": "chickpeas", "amount": 250, "unit": "g" },
            { "name": "potatoes", "amount": 400, "unit": "g" },
            { "name": "chicken broth", "amount": 8, "unit": "cups" },
            { "name": "greek yogurt", "amount": 50, "unit": "g" },
            { "name": "lemon", "amount": 2, "unit": "" },
            { "name": "cilantro", "amount": 15, "unit": "g" }
        ],

        "instructions": [
            { "stepNumber": "Heat the oil in a large skillet over medium heat until shimmering. Add the onion and cook, stirring occasionally, until soft, about 5 minutes. Add the garlic, turmeric, coriander, salt, and pepper, and cook, stirring occasionally, for 2 minutes. Transfer to a 6-quart or larger slow cooker." },
            { "stepNumber": "Add the chickpeas, potatoes, and broth, and stir to combine. Cover and cook on the LOW setting until the beans are tender, 8 to 10 hours." },
            { "stepNumber": "Use an immersion blender to purée the soup until smooth in the slow cooker, or purée the soup in a blender, working in batches if necessary." },
            { "stepNumber": "Ladle into bowls, then garnish with a dollop of Greek yogurt, a squeeze of lemon juice, and cilantro." }
        ],
        "images": [
            { "path": "https://cdn.apartmenttherapy.info/image/upload/f_auto,q_auto:eco,c_fill,g_center,w_764,h_955/k%2Farchive%2F56d729bb3770e8363cc627a03fab72b137e90cd" },
            { "path": "https://cdn.apartmenttherapy.info/image/upload/f_auto,q_auto:eco,c_fit,w_764,h_955/k%2Farchive%2F72073ef26b68dc1964613b500cd42122043a2568" }
        ]
    },
    "12": {
        "id": "12",
        "name": "Quesadillas",
        "description": "The humble quesadilla wears many hats. It's a quick weeknight meal that can transform yesterday's leftovers into something new and tasty. It's also a fuss-free snack that will satisfy a group of hungry teenagers — or the crowd at your next cocktail party. Fill it with plain cheese and beans or with shrimp and avocado; the quesadilla is whatever you want to make it.",
        "preptime": 15,
        "difficulty": "Easy",
        "cooktime": 50,
        "servings": 4,

        "calories": 396,
        "fat": 9,
        "satfat": 1,
        "carbs": 37,
        "fiber": 8,
        "sugar": 21,
        "protein": 37,

        "ingredients": [
            { "name": "onions", "amount": 100, "unit": "g" },
            { "name": "red bell pepper", "amount": 150, "unit": "g" },
            { "name": "mild cheddar cheese", "amount": 125, "unit": "g" },
            { "name": "skirt steak", "amount": 500, "unit": "g" },
            { "name": "salt", "amount": 1, "unit": "teaspoons" },
            { "name": "cumin gruond", "amount": 10, "unit": "g" },
            { "name": "black pepper", "amount": 5, "unit": "g" },
            { "name": "tortillas", "amount": 4, "unit": "" }
        ],

        "instructions": [
            { "stepNumber": "Thinly slice 1 medium yellow onion. Core, seed, and thinly slice 1 medium bell pepper. Grate 16 ounces Monterey Jack, mild cheddar cheese, or a combination on the large holes of a box grater (about 5 cups). Pat 1 pound flank or skirt steak dry with paper towels, then season all over with 1 teaspoon of the kosher salt, 1 teaspoon ground cumin, and 1/4 teaspoon black pepper. Cut the skirt steak crosswise into 2 to 3 pieces to fit in the skillet if needed." },
            { "stepNumber": "Heat 1 tablespoon of the vegetable oil in a 12-inch cast iron skillet or heavy frying pan over medium-high heat until just starting to smoke. Working in 2 batches if needed, place the steak in the pan and cook undisturbed for 1 minute. Flip and continue to cook, flipping every minute, until both sides have a nice char, and the steak registers 130°F for medium-rare, about 4 minutes total, or 140°F for medium, about 6 to 8 minutes total. Transfer the steak to a clean cutting board, loosely cover with aluminum foil, and let rest while you cook the peppers and onions." },
            { "stepNumber": "Reduce the heat to medium and add the remaining 1 tablespoon vegetable oil to the skillet. Add the onion, the remaining 1/4 teaspoon kosher salt, and a few grinds black pepper. Cook, stirring occasionally, until softened and lightly charred around the edges, about 5 minutes. Transfer the onions and peppers to a bowl. Wipe the skillet clean." },
            { "stepNumber": "Thinly slice the steak across the grain or dice." },
            { "stepNumber": "Place 4 (10-inch) flour tortillas on a work surface. Sprinkle 1/2 cup of the shredded cheese onto one half of each tortilla, leaving a 1/2-inch border from the edge. Divide the steak, peppers, and onions over the cheese. Sprinkle the remaining cheese over the steak and vegetables. Fold each tortilla in half over the filling and gently press down." },
            { "stepNumber": "Brush the skillet with a thin layer of vegetable oil. Add 2 quesadillas to the pan and cook over medium-low heat until the cheese is mostly melted and the bottoms are browned, 1 to 2 minutes. Flip with a thin metal spatula and cook until the cheese is melted and the second side is browned." },
            { "stepNumber": "Transfer the quesadillas to a cutting board. Brush the skillet with more oil and repeat cooking the remaining quesadillas. Cut the quesadillas into wedges. Serve with sour cream, salsa, and/or guacamole if desired." }
        ],
        "images": [
            { "path": "https://cdn.apartmenttherapy.info/image/upload/f_auto,q_auto:eco,c_fill,g_center,w_764,h_955/k%2Farchive%2Fc1ad29bc50316c85541ae423a8b710769e4529b" },
            { "path": "https://cdn.apartmenttherapy.info/image/upload/f_auto,q_auto:eco,c_fit,w_764,h_955/k%2Farchive%2F100bfe92feeda771e2964654c095f2611485a385" }
        ]
    },
    "13": {
        "id": "13",
        "name": "Taco salad",
        "description": "onestly, is there a better salad than taco salad? Crisp romaine gets punched up with cilantro and onions, then tossed with crunchy tortilla strips, spicy ground beef, shredded cheese, and lots of fresh veggies like corn and tomatoes. It's the perfect combination of flavors and textures.",
        "preptime": 25,
        "difficulty": "Easy",
        "cooktime": 15,
        "servings": 6,

        "calories": 396,
        "fat": 9,
        "satfat": 1,
        "carbs": 37,
        "fiber": 8,
        "sugar": 21,
        "protein": 37,

        "ingredients": [
            { "name": "olive oil", "amount": 50, "unit": "ml" },
            { "name": "corn tortillas", "amount": 3, "unit": "6-inch" },
            { "name": "kosher salt", "amount": 10, "unit": "g" },
            { "name": "beef", "amount": 500, "unit": "g" },
            { "name": "tomato salsa", "amount": 0.5, "unit": "cup" },
            { "name": "taco seasoning", "amount": 2, "unit": "tbsp" }
        ],

        "instructions": [
            { "stepNumber": "Fry the tortilla strips. Heat the oil in a large skillet over medium-high heat until shimmering. Add the tortilla strips and fry, stirring occasionally, until golden-brown and crisp, 2 to 3 minutes. Remove the tortilla strips to a paper towel and sprinkle with salt." },
            { "stepNumber": "Cook the taco beef. Drain off any excess oil from the skillet and return it to medium-high heat. Add the beef and cook, breaking the meat up into small pieces with a stiff spatula, until cooked through and starting to brown, about 8 minutes. Add the salsa and taco seasoning and cook until the liquid in the pan thickens slightly, 2 to 3 minutes more. Remove the skillet from the heat while you build the rest of the salad." },
            { "stepNumber": "Make the dressing. Whisk all the ingredients together in a small bowl." },
            { "stepNumber": "Build the salad. Place the romaine, cilantro, and scallions or onion in a large bowl and toss to combine. Add the corn, black beans, tomatoes, cheese, and avocado if using. Top the salad with the browned beef and tortilla strips." },
            { "stepNumber": "Dress the salad and serve. Just before serving, add half of the dressing to the salad and use tongs to toss until well coated. Taste and add more dressing, if desired." }
        ],
        "images": [
            { "path": "https://cdn.apartmenttherapy.info/image/upload/f_auto,q_auto:eco,c_fill,g_center,w_764,h_955/k%2Farchive%2F1569a5fb210c5da5c7d1d8d03e4446f430442c1" },
            { "path": "https://cdn.apartmenttherapy.info/image/upload/f_auto,q_auto:eco,c_fit,w_764,h_955/k%2Farchive%2F9553c63e459449416dd91c26bd88787bd692b31f" }
        ]
    },
    "14": {
        "id": "14",
        "name": "California Roll",
        "description": "hances are probably pretty good that one of the first types of sushi you ever tried was the California roll. I like to think of it as the gateway sushi for children — and also for adults who aren't quite ready to take the plunge with raw fish sushi right off the bat. With layers of rice and seaweed blanketing sweet crabmeat (or imitation crabsticks) and either avocado or cucumber for a pop of green color, its mild flavor makes it perfect for dunking in a little saucer of soy sauce with some wasabi stirred in.",
        "preptime": 40,
        "difficulty": "Easy",
        "cooktime": 15,
        "servings": 6,

        "calories": 396,
        "fat": 9,
        "satfat": 1,
        "carbs": 37,
        "fiber": 8,
        "sugar": 21,
        "protein": 37,

        "ingredients": [
            { "name": "sushi rice", "amount": 1, "unit": "cup" },
            { "name": "water", "amount": 1.5, "unit": "cup" },
            { "name": "rice vinegar", "amount": 2, "unit": "tbsp" },
            { "name": "granulated sugar", "amount": 2, "unit": "tbsp" },
            { "name": "kosher salt", "amount": 2, "unit": "tbsp" },
            { "name": "crabsticks", "amount": 16, "unit": "pieces" },
            { "name": "nori seaweed", "amount": 3, "unit": "sheets" },
            { "name": "cucumbers", "amount": 50, "unit": "g" },
            { "name": "avocado", "amount": 1, "unit": "" },
            { "name": "sesame seeds", "amount": 15, "unit": "g" }
        ],

        "instructions": [
            { "stepNumber": "Rinse the rice. Place the rice in a fine-mesh strainer and rinse under cold water for a minute to get rid of some of the milky starch. Drain well." },
            { "stepNumber": "Cook the rice. Place the rice and water in a medium saucepan and bring to a boil over medium-high heat. Cover and cook on low heat for 15 minutes. Remove from the heat and let steam, covered, for 15 minutes. (Alternatively, cook the rice in a rice cooker.) Meanwhile, prepare the vinegar seasoning and fillings." },
            { "stepNumber": "Make the vinegar seasoning. Microwave the vinegar, sugar, and salt together in a small microwave-safe bowl in 15-second bursts, stirring between bursts, until warm to the touch and the sugar and salt are dissolved, 1 to 2 bursts. (You can also do this in a small saucepan on the stove.)" },
            { "stepNumber": "Prepare the crabsticks and nori sheets. Unwrap the crabsticks if needed. Halve the nori sheets: for each sheet, position it with a long side closer to you. (If the nori is scored with lines, the lines should be running from top to bottom.) Fold it in half from left to right, it should then easily tear along the crease." },
            { "stepNumber": "Prepare the cucumber and avocado. Cut the cucumbers lengthwise into pencil-thin sticks (about 1/3-inch wide). Halve and pit the avocado. Peel the avocado, then cut lengthwise into 1/3-inch thick slices. For the wide center slices, lay them flat and cut into 1/3-inch wide sticks so that they are shaped like the cucumber sticks." },
            { "stepNumber": "Season and cool the rice. When the rice is ready, transfer it to a large, wide bowl. Drizzle with the vinegar mixture and fold it in with a rubber spatula until thoroughly combined and cooled to room temperature. You can speed up the process by fanning it while folding." },
            { "stepNumber": "Top the nori with rice. Have a small bowl of water for dampening hands handy. Place a bamboo sushi mat on a work surface with the slats running from side to side. Place a sheet of nori with a long side lined up with the bottom edge of the mat. With dampened hands, place 1/6 (scant 2/3 cup) of the rice on the nori and press into an even layer to the edges." },
            { "stepNumber": "Sprinkle with sesame seeds. Sprinkle the rice with about 1/4 teaspoon sesame seeds." },
            { "stepNumber": "Flip the nori and rice over and press. Flip the rice-covered nori over. Fold the top half of the bamboo mat over the nori and press down to compact the rice slightly." },
            { "stepNumber": "Add the filling to the nori side. Open the mat up again. Lay 2 crabsticks across the middle of the nori. Place a row of cucumber sticks next to the crabsticks (trim them as needed to fit). Top the crabsticks with avocado slices, trimming as needed to fit." },
            { "stepNumber": "Roll the sushi. Lift up the bottom edge of the mat and roll until the top and bottom of the nori are touching and the mat is completely wrapped over the sushi roll." },
            { "stepNumber": "Mold the sushi. While holding the mat over the sushi roll in place, gently pull the top of the mat to pull it taut. Gently squeeze along the length of the roll so that it holds together." },
            { "stepNumber": "Shape the sushi if needed. Unroll the mat. Check the sushi roll. If it is not perfectly round, fold the mat over the roll and gently shape it into a round shape." },
            { "stepNumber": "Repeat rolling. Transfer the sushi to a plate seam-side down. If there is any rice stuck to the bamboo mat, remove it before making the next sushi roll. Roll the remaining pieces of nori, you may have some cucumber and avocado left." },
            { "stepNumber": "Cut each roll into 6 pieces. Cut the sushi rolls with a damp knife — a very sharp chef's knife or serrated knife works best. For each roll, cut it in half crosswise. Place the two pieces next to each other and cut twice more so that you end up with 6 pieces. Turn the pieces so that they are cut side up. For the best presentation, place the two end pieces in the middle." },
            { "stepNumber": "Serve the sushi. The sushi is best served within an hour or two, so keep covered in plastic wrap to prevent it from drying out if not serving immediately. Serve with wasabi, pickled ginger, and soy sauce or tamari for dipping." }
        ],
        "images": [
            { "path": "https://cdn.apartmenttherapy.info/image/upload/f_auto,q_auto:eco,c_fill,g_center,w_764,h_955/k%2FPhoto%2FRecipes%2F2021-09-peanut-butter-oatmeal%2F2021-09-1_ATK6875" },
            { "path": "https://cdn.apartmenttherapy.info/image/upload/f_auto,q_auto:eco,c_fit,w_764,h_955/k%2FPhoto%2FRecipes%2F2021-09-peanut-butter-oatmeal%2F2021-09-13_ATK6865" }
        ]
    },
    "15": {
        "id": "15",
        "name": "Spaghetti with guanciale and eggs",
        "description": "The carbonara sauce is prepared in a matter of minutes. Just think that all you need is spicy guanciale cut into strips, a golden cream made with yolks (in our version) and a lot of grated Pecorino cheese. ",
        "preptime": 15,
        "difficulty": "Easy",
        "cooktime": 10,
        "servings": 4,

        "calories": 396,
        "fat": 9,
        "satfat": 1,
        "carbs": 37,
        "fiber": 8,
        "sugar": 21,
        "protein": 37,

        "ingredients": [
            { "name": "spaghetti", "amount": 320, "unit": "g" },
            { "name": "guanciale", "amount": 150, "unit": "g" },
            { "name": "egg yolks", "amount": 6, "unit": "" },
            { "name": "Pecorino Romano cheese ", "amount": 50, "unit": "g" },
            { "name": "black pepper", "amount": 1, "unit": "pinch" }
        ],

        "instructions": [
            { "stepNumber": "To prepare spaghetti carbonara start by putting a pot of salted water on the burner to cook the pasta. In the meantime, remove the pork rind from the guanciale 1 and cut it first into slices and then into strips about 1/2 (1cm)  2 thick. The removed rind can be reused to flavor other things. Put the pieces into a non-stick pan 3 and brown for about 15 minutes over medium heat, being careful not to burn it or it will smell too strong." },
            { "stepNumber": "Meanwhile, put spaghetti in boiling water 4 and cook for the time indicated on the package. In the meantime, pour the yolks into a bowl 5, add most of the Pecorino cheese needed for the recipe and the remaining part will be used just before serving." },
            { "stepNumber": "Season with black pepper 7 and whip by hand 8. Add a tablespoon of cooking water to dilute the mixture and stir 9." },
            { "stepNumber": "In the meantime the guanciale will be cooked, turn off the burner and set it aside 10. Drain the pasta al dente directly into the pan with the guanciale 11 and stir it briefly to season it. Remove from heat and pour the mixture of eggs and pecorino cheese 12 into the pan. Mix quickly to combine." },
            { "stepNumber": "To make it very creamy, if necessary, you can add a little cooking water to your pasta 13. Serve spaghetti carbonara immediately with the remaining pecorino cheese 14 and ground black pepper 15 on top." }
        ],

        "images": [
            { "path": "https://i.pinimg.com/564x/0c/01/3a/0c013a45084b3ec8ec2084dfdd7d84f5.jpg" },
            { "path": "https://i.pinimg.com/564x/e0/e2/67/e0e2677cb75dd29f93ce17de3cc73731.jpg" }
        ]
    },

    "16": {
        "id": "16",
        "name": "Peanut Butter Oatmeal",
        "description": "A hot bowl of oatmeal is one of the easiest, most satisfying breakfasts you can make — especially when peanut butter's involved. This recipe will show you how to make the best, easiest peanut butter oatmeal in just 15 minutes, with instructions fo[ both the stovetop and the microwave. Let's get started.",
        "preptime": 5,
        "difficulty": "Easy",
        "cooktime": 12,
        "servings": 2,

        "calories": 396,
        "fat": 9,
        "satfat": 1,
        "carbs": 37,
        "fiber": 8,
        "sugar": 21,
        "protein": 37,

        "ingredients": [
            { "name": "milk", "amount": 1, "unit": "cup" },
            { "name": "honey", "amount": 2, "unit": "tbs" },
            { "name": "kosher salt", "amount": 1, "unit": "ts" },
            { "name": "rolled oats", "amount": 1, "unit": "cup" },
            { "name": "peanut butter", "amount": 2, "unit": "tbsp" }
        ],

        "instructions": [
            { "stepNumber": "Place 1 1/2 cups milk or water, 2 tablespoons maple syrup or honey, and 1/4 teaspoon kosher salt in a medium saucepan and bring to a boil over high heat. Reduce the heat to medium-low to maintain a gentle simmer." },
            { "stepNumber": "Add 1 cup old-fashioned rolled oats and stir to combine. Cook, stirring often, until about 2/3 of the liquid has been absorbed by the oats, 3 1/2 to 4 1/2 minutes. (The oatmeal will still look very runny.) Remove the saucepan from the heat, cover, and let rest for 5 minutes." },
            { "stepNumber": "Uncover, add 2 tablespoons peanut butter, and stir until well combined. Serve immediately with your choice of toppings." }
        ],
        "images": [
            { "path": "https://cdn.apartmenttherapy.info/image/upload/f_auto,q_auto:eco,c_fill,g_center,w_764,h_955/k%2FPhoto%2FRecipes%2F2021-09-peanut-butter-oatmeal%2F2021-09-1_ATK6875" },
            { "path": "https://cdn.apartmenttherapy.info/image/upload/f_auto,q_auto:eco,c_fit,w_764,h_955/k%2FPhoto%2FRecipes%2F2021-09-peanut-butter-oatmeal%2F2021-09-13_ATK6865" }
        ]

    },
    "17": {
        "id": "17",
        "name": "Easy Oatmeal Pancakes",
        "description": "A simple, homey recipe for pancakes made with old-fashioned rolled oats.",
        "preptime": 15,
        "difficulty": "Easy",
        "cooktime": 20,
        "servings": 12,

        "calories": 396,
        "fat": 9,
        "satfat": 1,
        "carbs": 37,
        "fiber": 8,
        "sugar": 21,
        "protein": 37,

        "ingredients": [
            { "name": "rolled oats", "amount": 2, "unit": "cups" },
            { "name": "milk", "amount": 75, "unit": "ml" },
            { "name": "eggs", "amount": 2, "unit": "" },
            { "name": "unsalted butter", "amount": 25, "unit": "g" },
            { "name": "granulated sugar", "amount": 20, "unit": "g" },
            { "name": "all-purpose flour", "amount": 50, "unit": "g" },
            { "name": "baking powder", "amount": 1, "unit": "tbs" },
            { "name": "kosher salt", "amount": 1, "unit": "pinch" },
            { "name": "cinnamon", "amount": 0.5, "unit": "tbs" }
        ],

        "instructions": [
            { "stepNumber": "Whisk 1 cup rolled oats and 1 cup milk together in a large bowl. Let stand for 10 minutes for the oats to soften. Meanwhile, melt 1 tablespoon unsalted butter and set it aside to cool." },
            { "stepNumber": "Add the butter, 2 eggs, and 1 tablespoon granulated sugar to the oats, and whisk to combine. Add 2/3 cup all-purpose flour, 2 teaspoons baking powder, 1/4 teaspoon kosher salt, and 1/4 teaspoon ground cinnamon, if desired, and whisk until just combined; do not overmix. Let stand for 5 minutes more. Meanwhile, heat a large cast iron or nonstick skillet over medium-high heat." },
            { "stepNumber": "Add 1 teaspoon butter to the pan and swirl to coat. Drop the batter into the pan in 2-tablespoon portions, cooking 3 at a time. Cook until bubbles appear on the surface, the edges begin to look dry, and the bottoms are golden-brown, about 3 minutes. Flip the pancakes and cook until the other side is golden-brown, 2 to 3 minutes more." },
            { "stepNumber": "Transfer the pancakes to a warm oven or plate. Repeat cooking the remaining batter, using 1 teaspoon butter for each batch." }
        ],
        "images": [
            { "path": "https://cdn.apartmenttherapy.info/image/upload/f_auto,q_auto:eco,c_fill,g_center,w_764,h_955/k%2FPhoto%2FRecipes%2F2019-09-easy-oatmeal-pancakes%2Foatmeal-pancakes-beuty_047" },
            { "path": "https://cdn.apartmenttherapy.info/image/upload/f_auto,q_auto:eco,c_fit,w_764,h_955/k%2FPhoto%2FRecipes%2F2019-09-easy-oatmeal-pancakes%2Foatmeal-pancakes-process_022" }
        ]
    },
    "18": {
        "id": "18",
        "name": "Banana Split with Yogurt and Jam",
        "description": "A banana split for breakfast? Oh, yes! This quick, easy breakfast takes a dessert classic and lightens it up for the morning with ultra-creamy Greek yogurt and a warm drizzle of jam.",
        "preptime": 5,
        "difficulty": "Easy",
        "cooktime": 0,
        "servings": 1,

        "calories": 396,
        "fat": 9,
        "satfat": 1,
        "carbs": 37,
        "fiber": 8,
        "sugar": 21,
        "protein": 37,

        "ingredients": [
            { "name": "banana", "amount": 1, "unit": "ripe" },
            { "name": "greek yogurt", "amount": 0.5, "unit": "cup" },
            { "name": "jam", "amount": 20, "unit": "g" },
            { "name": "almonds", "amount": 50, "unit": "g" },
            { "name": "blueberries", "amount": 75, "unit": "g" }
        ],

        "instructions": [
            { "stepNumber": "Split the banana lengthwise and lay the two halves in a shallow bowl. Use an ice cream scoop to scoop out the yogurt and put it on top of the banana. Warm the jam in the microwave for 15 to 30 seconds, or until it is very runny." },
            { "stepNumber": "Use a spoon to drizzle the jam over the yogurt, and sprinkle the nuts over everything. Top with the blueberries, and dig in!" }
        ],

        "images": [
            { "path": "https://cdn.apartmenttherapy.info/image/upload/f_auto,q_auto:eco,c_fit,w_764,h_1107/k%2Farchive%2F1e78a64b50bf4b9f34ead89415a9c65b842cc9ba" },

            { "path": "https://cdn.apartmenttherapy.info/image/upload/f_auto,q_auto:eco,c_fill,g_center,w_764,h_955/k%2Farchive%2Fc4ebbb01058f6fcf4f01e150a2e0a6cb49d8abf" }
        ]
    },
    "19": {
        "id": "19",
        "name": "Fruit on the Bottom Yogurt Cups",
        "description": "Yogurt cups are one of my favorite on-the-go breakfasts or fuss-free lunches. They're convenient, easy to grab, and yummy. But they are often too sweet for me, and so I wondered why I was settling for the flavors at the grocery store. Why not make my own?",
        "preptime": 5,
        "difficulty": "Easy",
        "cooktime": 0,
        "servings": 1,

        "calories": 396,
        "fat": 9,
        "satfat": 1,
        "carbs": 37,
        "fiber": 8,
        "sugar": 21,
        "protein": 37,

        "ingredients": [
            { "name": "yogurt", "amount": 1, "unit": "cup" },
            { "name": "fresh fruit", "amount": 100, "unit": "g" },
            { "name": "jam", "amount": 20, "unit": "g" },
            { "name": "granola", "amount": 50, "unit": "g" }
        ],

        "instructions": [
            { "stepNumber": "Spoon half of the yogurt in a half-pint jar. Add the fruit and drizzle with the jam. Spoon the remaining yogurt on top. Sprinkle over the granola or nuts, if using. Seal the jar and pack it up for work or school, or enjoy it immediately." }
        ],
        "images": [
            { "path": "https://cdn.apartmenttherapy.info/image/upload/f_auto,q_auto:eco,c_fit,w_764,h_1145/k%2Farchive%2F25deacd6bf76559fb18c770d39111a47dc177335" },
            { "path": "https:cdn.apartmenttherapy.info/image/upload/f_auto,q_auto:eco,c_fit,w_764,h_510/k%2Farchive%2F70912f5f094661040336385a6d5e49c00cd140f8" }
        ]
    },
    "20": {
        "id": "20",
        "name": "Soft & Chewy Granola",
        "description": "Forget everything you think you know about granola. Let go of your crunchy, overly sweet, oat-filled expectations, and the results are magically different and incredibly satisfying. This is nowhere near your average granola — which is exactly why I seriously can't get enough of the stuff.",
        "preptime": 15,
        "difficulty": "Easy",
        "cooktime": 0,
        "servings": 5,

        "calories": 396,
        "fat": 9,
        "satfat": 1,
        "carbs": 37,
        "fiber": 8,
        "sugar": 21,
        "protein": 37,

        "ingredients": [
            { "name": "olive oil", "amount": 2, "unit": "tbs" },
            { "name": "millet", "amount": 20, "unit": "g" },
            { "name": "almonds", "amount": 3, "unit": "tbs" },
            { "name": "pumpkin seeds", "amount": 3, "unit": "tbs" },
            { "name": "sunflower seeds", "amount": 3, "unit": "tbs" },
            { "name": "dried apricots ", "amount": 1, "unit": "cup" },
            { "name": "chia seeds", "amount": 2, "unit": "tbs" },
            { "name": "flaxseed", "amount": 2, "unit": "tbs" },
            { "name": "sesame", "amount": 1, "unit": "tbs" },
            { "name": "unsalted butter", "amount": 20, "unit": "g" },
            { "name": "honey", "amount": 2, "unit": "tbs" }
        ],

        "instructions": [
            { "stepNumber": "Arrange a rack in the middle of the oven and heat to 275°F. Line a rimmed baking sheet with parchment paper." },
            { "stepNumber": "Heat the oil in a large frying pan over medium heat until shimmering. Add the millet and cook, stirring frequently, until toasted and golden-brown, 3 to 4 minutes. Remove from the heat and let cool for 5 minutes. Transfer to a large bowl." },
            { "stepNumber": "Add the almonds, pumpkin seeds, sunflower seeds, apricots, chia seeds, flaxseed meal, sesame seeds, melted butter, and 1/2 cup of the honey and stir to combine. Pour the mixture onto the prepared baking sheet and spread into an even layer." },
            { "stepNumber": "Bake for 20 minutes. Stir the mixture, drizzle with the remaining 2 tablespoons honey, and bake for 10 minutes more." },
            { "stepNumber": "Transfer the baking sheet to a wire rack and cool the granola completely. Store in an airtight container." }
        ],
        "images": [
            { "path": "https://cdn.apartmenttherapy.info/image/upload/f_auto,q_auto:eco,c_fit,w_764,h_955/k%2Farchive%2F03f297ebad0cdb89ea2c36ee693b8a47cb0e910a" },
            { "path": "https://cdn.apartmenttherapy.info/image/upload/f_auto,q_auto:eco,c_fill,g_center,w_764,h_955/k%2Farchive%2F3d6107ca0c35123488b1364387292cd272a4394" }
        ]
    },
    "21": {
        "id": "21",
        "name": "American pancakes",
        "description": "This easy American pancake recipe makes light and fluffy pancakes that are great for a weekend brunch. Try adding a large handful of fresh blueberries to the batter before cooking.",
        "preptime": 25,
        "difficulty": "Easy",
        "cooktime": 30,
        "servings": 2,
        "calories": 1250,
        "fat": 112,
        "satfat": 21,
        "carbs": 45,
        "fiber": 4,
        "sugar": 8,
        "protein": 120,
        "ingredients": [

            { "name": "self-raising flour", "amount": 200, "unit": "g" },
            { "name": "baking powder", "amount": 1, "unit": "tbs" },
            { "name": "golden caster sugar", "amount": 3, "unit": "tbs" },
            { "name": "eggs", "amount": 3, "unit": "" },
            { "name": "butter", "amount": 25, "unit": "g" },
            { "name": "milk", "amount": 50, "unit": "ml" },
            { "name": "vegetable oil", "amount": 15, "unit": "ml" },
            { "name": "maple syrup", "amount": 3, "unit": "tbs" },
            { "name": "blueberries", "amount": 3, "unit": "cups" }
        ],
        "instructions": [
            { "stepNumber": "Mix 200g self-raising flour, 1 ½ tsp baking powder, 1 tbsp golden caster sugar and a pinch of salt together in a large bowl." },
            { "stepNumber": "Create a well in the centre with the back of your spoon then add 3 large eggs, 25g melted butter and 200ml milk." },
            { "stepNumber": "Whisk together either with a balloon whisk or electric hand beaters until smooth then pour into a jug." },
            { "stepNumber": "Heat a small knob of butter and 1 tsp of oil in a large, non-stick frying pan over a medium heat. When the butter looks frothy, pour in rounds of the batter, approximately 8cm wide. Make sure you don’t put the pancakes too close together as they will spread during cooking. Cook the pancakes on one side for about 1-2 mins or until lots of tiny bubbles start to appear and pop on the surface. Flip the pancakes over and cook for a further minute on the other side. Repeat until all the batter is used up.        " },
            { "stepNumber": "Serve your pancakes stacked up on a plate with a drizzle of maple syrup and any of your favourite toppings." }
        ],
        "images": [
            { "path": "https://i.pinimg.com/564x/65/0b/f8/650bf8967862e522bb3061e225f5d0cd.jpg" },
            { "path": "https://i.pinimg.com/564x/70/1c/c7/701cc710dd5bcff8fd0304d6dc6e454d.jpg" }
        ]
    },

    "22": {
        "id": "22",
        "name": "Eggs Benedict",
        "description": "Eggs Benedict is a common American breakfast or brunch dish, consisting of two halves of an English muffin, each topped with Canadian bacon, a poached egg, and hollandaise sauce. It was popularized in New York City.",
        "preptime": 20,
        "difficulty": "Easy",
        "cooktime": 30,
        "servings": 2,
        "calories": 1340,
        "fat": 140,
        "satfat": 24,
        "carbs": 56,
        "fiber": 4,
        "sugar": 3,
        "protein": 158,
        "ingredients": [
            { "name": "wine vinegar", "amount": 3, "unit": "tbs" },
            { "name": "eggs", "amount": 4, "unit": "" },
            { "name": "muffins", "amount": 2, "unit": "toasting" },
            { "name": "hollandaise sauce", "amount": 20, "unit": "g" },
            { "name": "parma ham", "amount": 4, "unit": "slices" }
        ],
        "instructions": [
            { "stepNumber": "Bring a deep saucepan of water to the boil (at least 2 litres) and add 3 tbsp white wine vinegar." },
            { "stepNumber": "Break the eggs into four separate coffee cups or ramekins. Split the muffins, toast them and warm some plates." },
            { "stepNumber": "Swirl the vinegared water briskly to form a vortex and slide in an egg. It will curl round and set to a neat round shape. Cook for 2-3 mins, then remove with a slotted spoon." },
            { "stepNumber": "Repeat with the other eggs, one at a time, re-swirling the water as you slide in the eggs. Spread some sauce on each muffin, scrunch a slice of ham on top, then top with an egg. Spoon over the remaining hollandaise and serve at once." }
        ],
        "images": [
            { "path": "https://i.pinimg.com/564x/87/74/0b/87740b8a04c582af6757860044b84d39.jpg" },
            { "path": "https://i.pinimg.com/564x/91/f3/5d/91f35dcb367f3ae4f0fc2cc1d81582b8.jpg" }
        ]
    },

    "23": {
        "id": "23",
        "name": "French Toast",
        "description": "Bread dipped in egg and fried is a winner any which way, and this is a little bit different from its sweet counterparts. This is a great one to have in the freezer, for those days when you don’t have time to think about what to make for lunch. You can just pop them in the oven to reheat while you’re getting on with other things",
        "preptime": 5,
        "difficulty": "Easy",
        "cooktime": 10,
        "servings": 2,
        "calories": 1345,
        "fat": 89,
        "satfat": 12,
        "carbs": 46,
        "fiber": 3,
        "sugar": 11,
        "protein": 76,
        "ingredients": [

            { "name": "eggs", "amount": 2, "unit": "" },
            { "name": "whole milk", "amount": 80, "unit": "ml" },
            { "name": "double cream", "amount": 40, "unit": "ml" },
            { "name": "vanilla extract", "amount": 1, "unit": "tbsp" },
            { "name": "cinnamon", "amount": 0.5, "unit": "tbsp" },
            { "name": "brioche", "amount": 4, "unit": "slices" },
            { "name": "vegetable oil", "amount": 2, "unit": "tbsp" },
            { "name": "butter", "amount": 50, "unit": "g" }
        ],
        "instructions": [
            { "stepNumber": "Whisk together the eggs, milk, cream, vanilla and cinnamon." },
            { "stepNumber": "Lay the brioche slices in a single layer in a shallow dish and pour the egg mixture over them. Allow to soak for 2-3 mins, then carefully turn over and soak for 2 mins more." },
            { "stepNumber": "Heat 1 tbsp of the vegetable oil and butter in a non-stick frying pan over a medium heat until foaming." },
            { "stepNumber": " Carefully lift 2 slices of the soaked brioche out of the dish and add to the frying pan. Fry for 3 mins on each side, until golden and crisp, then place on a wire rack over a baking tray in a warm oven while you repeat with the remaining slices." },
            { "stepNumber": "Serve dusted in icing sugar and scattered with fresh berries, if you like." }
        ],
        "images": [
            { "path": "https://i.pinimg.com/564x/c7/53/63/c75363cf312a0eaf18eab46884dd6f2.jpg" },
            { "path": "https://www.pinterest.it/pin/398076054568771649/" }
        ]
    },

    "24": {
        "id": "24",
        "name": "Pear porridge",
        "description": "Have a filling, comforting breakfast ready in 10 minutes with this easy pear and almond porridge recipe. The simple combination of fresh juicy pear, crunchy almonds and a drizzle of sweet maple syrup is the perfect autumnal start to the day. ",
        "preptime": 10,
        "difficulty": "Easy",
        "cooktime": 20,
        "servings": 2,
        "calories": 840,
        "fat": 56,
        "satfat": 11,
        "carbs": 23,
        "fiber": 7,
        "sugar": 4,
        "protein": 87,
        "ingredients": [

            { "name": "pears", "amount": 2, "unit": "pieces" },
            { "name": "caster sugar", "amount": 100, "unit": "g" },
            { "name": "lemon juice", "amount": 14, "unit": "ml" },
            { "name": "vanilla bean paste", "amount": 1, "unit": "tsp" },
            { "name": "almond butter", "amount": 1, "unit": "tbsp" },
            { "name": "flaked almonds", "amount": 35, "unit": "g" }
        ],
        "instructions": [
            { "stepNumber": "Peel, halve and core the pears." },
            { "stepNumber": "Mix the sugar and lemon juice with 200ml water in a small saucepan. " },
            { "stepNumber": "Halve the vanilla pod and scrape the seeds into the pan, then add the pod (or add the vanilla bean paste). Heat until the sugar has dissolved." },
            { "stepNumber": "Add the pears and cover the surface with a circle of baking parchment (this will ensure the pears cook through evenly). Cook for 15-20 mins until the pears feel soft when poked with a knife, then leave to cool. Can be kept chilled in the liquid for up to one week." },
            { "stepNumber": "Meanwhile, make your porridge. Mix the almond butter with enough poached pear liquid to form a drizzling consistency, then spoon over the porridge and top the bowls with the pears. Scatter with the toasted flaked almonds." }
        ],
        "images": [
            { "path": "https://i.pinimg.com/564x/bb/28/39/bb283984950224f3c63612bf934942a2.jpg" },
            { "path": "https://i.pinimg.com/564x/46/58/c9/4658c9e082b67679ca112f36d2bca690.jpg" }
        ]
    },

    "25": {
        "id": "25",
        "name": "Feta cheese and tomato omelette",
        "description": "Feta is considered to be one of the oldest cheeses in the world. The earliest record of feta cheese dates back to the Byzantine Empire. It has been associated closely with Crete, located in present day Greece. ",
        "preptime": 25,
        "difficulty": "Easy",
        "cooktime": 30,
        "servings": 2,
        "calories": 1250,
        "fat": 112,
        "satfat": 21,
        "carbs": 45,
        "fiber": 4,
        "sugar": 8,
        "protein": 120,
        "ingredients": [
            { "name": "Feta cheese", "amount": 200, "unit": "g" },
            { "name": "eggs", "amount": 3, "unit": "" },
            { "name": "butter", "amount": 25, "unit": "g" },
            { "name": "milk", "amount": 175, "unit": "ml" },
            { "name": "vegetable oil", "amount": 2, "unit": "pieces" },
            { "name": "maple syrup", "amount": 2, "unit": "pieces" },
            { "name": "tomatoes", "amount": 80, "unit": "g" }
        ],
        "instructions": [
            { "stepNumber": "Mix 200g self-raising flour, 1 ½ tsp baking powder, 1 tbsp golden caster sugar and a pinch of salt together in a large bowl." },
            { "stepNumber": "Create a well in the centre with the back of your spoon then add 3 large eggs, 25g melted butter and 200ml milk." },
            { "stepNumber": "Whisk together either with a balloon whisk or electric hand beaters until smooth then pour into a jug." },
            { "stepNumber": "Heat a small knob of butter and 1 tsp of oil in a large, non-stick frying pan over a medium heat. When the butter looks frothy, pour in rounds of the batter, approximately 8cm wide. Make sure you don’t put the pancakes too close together as they will spread during cooking. Cook the pancakes on one side for about 1-2 mins or until lots of tiny bubbles start to appear and pop on the surface. Flip the pancakes over and cook for a further minute on the other side. Repeat until all the batter is used up.        " },
            { "stepNumber": "Serve your pancakes stacked up on a plate with a drizzle of maple syrup and any of your favourite toppings." }
        ],
        "images": [
            { "path": "https://i.pinimg.com/564x/1a/bc/f6/1abcf683d377e3f205da8a98ef09aa17.jpg" },
            { "path": "https://i.pinimg.com/564x/ea/19/f5/ea19f5e267a1a7de2b674c5a8e5a82c6.jpg" }
        ]
    },

    "26": {
        "id": "26",
        "name": "Apple crumble cake",
        "description": "Ultra soft apple crumb cake is loaded with warm cinnamon apples and extra crumb topping. A homemade version of classic New York style crumb cake, this breakfast cake is moist, deliciously spiced, and drizzled with sweet maple icing.",
        "preptime": 15,
        "difficulty": "Easy",
        "cooktime": 40,
        "servings": 2,
        "calories": 1250,
        "fat": 112,
        "satfat": 21,
        "carbs": 45,
        "fiber": 4,
        "sugar": 8,
        "protein": 120,
        "ingredients": [
            { "name": "apples", "amount": 150, "unit": "g" },
            { "name": "golden caster sugar", "amount": 80, "unit": "g" },
            { "name": "plain flour", "amount": 175, "unit": "g" },
            { "name": "butter", "amount": 110, "unit": "g" },
            { "name": "rolled oats", "amount": 65, "unit": "g" },
            { "name": "demerara sugar", "amount": 1, "unit": "tbsp" },
            { "name": "double cream", "amount": 90, "unit": "ml" }
        ],
        "instructions": [
            { "stepNumber": "Heat the oven to 190C/170 fan/gas 5." },
            { "stepNumber": "Toss 575g peeled, cored and sliced Bramley apples with 2 tbsp golden caster sugar and put in a 23cm round baking dish at least 5cm deep, or a 20cm square dish. Flatten down with your hand to prevent too much crumble falling through." },
            { "stepNumber": "Put 175g plain flour and 110g golden caster sugar in a bowl with a good pinch of salt." },
            { "stepNumber": "Slice in 110g cold butter and rub it in with your fingertips until the mixture looks like moist breadcrumbs. Shake the bowl and any big bits will come to the surface – rub them in. Alternatively, pulse in a processor until sandy (don’t over-process)." },
            { "stepNumber": "Pour the crumb mix over the apples to form a pile in the centre, then use a fork to even out." },
            { "stepNumber": "Gently press the surface with the back of the fork so the crumble holds together and goes crisp, then lightly drag the fork over the top for a decorative finish." },
            { "stepNumber": "Sprinkle 1 tbsp rolled oats and 1 tbsp demerara sugar over evenly, if you wish." },
            { "stepNumber": "Set on a baking tray and put in the preheated oven for 35-40 minutes, until the top is golden and the apples feel very soft when you insert a small, sharp knife. Leave to cool for 10 minutes before serving." }
        ],
        "images": [
            { "path": "https://i.pinimg.com/564x/3b/41/11/3b4111a6fa1f7b7f5c9a482bf2226675.jpg" },
            { "path": "https://i.pinimg.com/564x/c7/3a/23/c73a23fd4701014f5bbf39110e22738b.jpg" }
        ]
    },

    "27": {
        "id": "27",
        "name": "Carrot cake with mascarpone",
        "description": "A classic cake recipe from Mary Berry's 100 Cakes and Bakes book. The gorgeous and moist carrot cake is crowned with a creamy mascarpone topping and walnuts.",
        "preptime": 35,
        "difficulty": "Easy",
        "cooktime": 30,
        "servings": 8,
        "calories": 450,
        "fat": 62,
        "satfat": 12,
        "carbs": 23,
        "fiber": 2,
        "sugar": 15,
        "protein": 98,
        "ingredients": [
            { "name": "vegetable oil", "amount": 230, "unit": "ml" },
            { "name": "natural yogurt", "amount": 110, "unit": "g" },
            { "name": "eggs", "amount": 4, "unit": "" },
            { "name": "vanilla extract", "amount": 1, "unit": "tsp" },
            { "name": "orange zested", "amount": 50, "unit": "g" },
            { "name": "self-raising flour", "amount": 265, "unit": "g" },
            { "name": "muscovado sugar", "amount": 335, "unit": "g" },
            { "name": "carrots", "amount": 265, "unit": "g" },
            { "name": "raisins", "amount": 100, "unit": "g" },
            { "name": "walnuts", "amount": 100, "unit": "g" },
            { "name": "butter", "amount": 150, "unit": "g" },
            { "name": "icing sugar", "amount": 300, "unit": "g" },
            { "name": "soft cheese", "amount": 110, "unit": "g" }
        ],
        "instructions": [
            { "stepNumber": "Heat the oven to 180C/160C fan/gas 4. " },
            { "stepNumber": " Oil and line the base and sides of two 20cm cake tins with baking parchment. Whisk the oil, yogurt, eggs, vanilla and zest in a jug. Mix the flour, sugar, cinnamon and nutmeg with a good pinch of salt in a bowl. Squeeze any lumps of sugar through your fingers, shaking the bowl a few times to bring the lumps to the surface." },
            { "stepNumber": "Add the wet ingredients to the dry, along with the carrots, raisins and half the nuts, if using. Mix well to combine, then divide between the tins." },
            { "stepNumber": "Bake for 25-30 mins or until a skewer inserted into the centre of the cake comes out clean. If any wet mixture clings to the skewer, return to the oven for 5 mins, then check again. Leave to cool in the tins." },
            { "stepNumber": "To make the icing, beat the butter and sugar together until smooth. Add half the soft cheese and beat again, then add the rest (adding it bit by bit prevents the icing from splitting). " },
            { "stepNumber": "Remove the cakes from the tins and sandwich together with half the icing. Top with the remaining icing and scatter with the remaining walnuts. Will keep in the fridge for up to five days. Best eaten at room temperature." }
        ],
        "images": [
            { "path": "https://i.pinimg.com/564x/bb/ac/f5/bbacf5ddac7f129122c144d05accfa2a.jpg" },
            { "path": "https://i.pinimg.com/564x/8e/4f/8c/8e4f8cf5e660c6d37ba7d90970fa559e.jpg" }
        ]
    },

    "28": {
        "id": "28",
        "name": "Cinnamon rolls",
        "description": "Try these easy cinnamon rolls with vanilla icing as a treat for afternoon tea. They're delicious served warm or cold – you can also make them ahead and freeze.",
        "preptime": 45,
        "difficulty": "Easy",
        "cooktime": 50,
        "servings": 8,
        "calories": 950,
        "fat": 92,
        "satfat": 21,
        "carbs": 65,
        "fiber": 4,
        "sugar": 12,
        "protein": 50,

        "ingredients": [
            { "name": "self-raising flour", "amount": 300, "unit": "g" },
            { "name": "caster sugar", "amount": 2, "unit": "tbsp" },
            { "name": "cinnamon", "amount": 1, "unit": "tbsp" },
            { "name": "butter", "amount": 70, "unit": "g" },
            { "name": "egg yolks", "amount": 2, "unit": "" },
            { "name": "golden syrup", "amount": 50, "unit": "ml" },
            { "name": "icing sugar", "amount": 60, "unit": "g" }
        ],

        "instructions": [
            { "stepNumber": "Heat oven to 180C/fan 160C/gas 4. Grease a 20cm loose-bottomed cake tin and line the bottom with baking parchment. " },
            { "stepNumber": "Mix the flour, caster sugar and cinnamon together with a pinch of salt in a bowl. Whisk the butter, egg yolks and milk together and combine with the dry ingredients to make a soft dough. Turn out onto a floured surface and roll out to a rectangle, about 30 x 25cm." },
            { "stepNumber": "Mix the filling ingredients together. Spread evenly over the dough then roll it up lengthways, like a Swiss roll, to form a log. " },
            { "stepNumber": "Using a sharp knife, cut the dough into 8 even-sized slices and pack into the prepared tin. Brush gently with extra milk and bake for 30-35 mins or until golden brown. Remove from the oven and cool for 5 mins before removing from the tin." },
            { "stepNumber": "Sift the icing sugar into a large bowl and make a well in the centre. " },
            { "stepNumber": "Place the cream cheese and butter in the centre, pour over 2 tbsp boiling water, and stir to mix. Add a little more water until you have a drizzly consistency. Stir in the vanilla essence, then drizzle the icing over the rolls. Serve warm or cold." }
        ],
        "images": [
            { "path": "https://i.pinimg.com/564x/22/a7/7e/22a77eeeee66ee04b4561f1b7a4e23bb.jpg" },
            { "path": "https://i.pinimg.com/564x/af/50/1b/af501b79546bf2cdda50533f81f6ecdb.jpg" }
        ]
    }

}